app/views/forums/show.html.erb

SELECT "forum_threads".* FROM "forum_threads" WHERE ("forum_threads".forum_id = 1)
---
  </tr>
  <% @forum.forum_threads.each do |f| %>

SELECT COUNT(*) FROM "forum_posts" WHERE ("forum_posts".forum_thread_id = 1)
---
    <td><%=link_to f.title, forum_forum_thread_path(f)%></td>
    <td><%=f.forum_posts.size%></td>