app/views/users/index.html.erb

SELECT "roles"."id" FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = NULL ) AND ("roles"."name" = 'Admin') LIMIT 1
---
    <td class="thread_td"><%= "#{u.email}" %></td>
    <td class="thread_td"><%= "#{u.roles.collect{|r| r.name}}" %></td>