app/views/users/show.html.erb

      <td class="oce-first">Role:</td>
      <td><%= @user.roles.first.name %></td>
---
SELECT "roles"."id" FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 1 ) AND ("roles"."name" = 'Admin') LIMIT 1