app/controllers/forums_controller.rb

  def index
    if can?(:read, Forum)
      @forums = Forum.all
---
SELECT "forums".* FROM "forums"

  def show
    @forum = Forum.find(params[:id]) if can?(:read, Forum)
---
SELECT "forums".* FROM "forums" WHERE ("forums"."id" = 0) LIMIT 1

  def create
    @forum = Forum.new(params[:forum])
    respond_to do |format|
      if can?(:create, Forum) and @forum.save
---
INSERT INTO "forums" ("updated_at", "name", "description", "created_at") VALUES ('2011-01-18 19:26:09.148902', 'Det andre forumet', 'sdjdsj dsjidsids dsidsids dsidsi dsids ds sdi sdjdsj dsjidsids dsidsids dsidsi dsids ds sdi sdjdsj dsjidsids dsidsids dsidsi dsids ds sdi sdjdsj dsjidsids dsidsids dsidsi dsids ds sdi.', '2011-01-18 19:26:09.148902')