app/controllers/forum_posts_controller.rb

  def new
    if can?(:create, ForumPost)
      @forum_thread = ForumThread.find(params[:forum_thread_id])
---
SELECT "forum_threads".* FROM "forum_threads" WHERE ("forum_threads"."id" = 1) LIMIT 1

  def edit
    @forum_post = ForumPost.find(params[:id])
---
SELECT "forum_posts".* FROM "forum_posts" WHERE ("forum_posts"."id" = 1) LIMIT 1

  def create
    @forum_post = ForumPost.new(params[:forum_post])
    @forum_thread = ForumThread.find(params[:forum_thread_id])
    @forum_post.forum_thread = @forum_thread
    @forum_post.user = current_user
    @forum_thread.user = current_user

    respond_to do |format|
      if can?(:create, ForumPost) and @forum_post.save
---
SELECT "forum_threads".* FROM "forum_threads" WHERE ("forum_threads"."id" = 1) LIMIT 1
INSERT INTO "forum_posts" ("updated_at", "forum_thread_id", "user_id", "title", "body", "created_at") VALUES ('2011-01-29 01:15:28.453209', 1, 2, 'Kalles kjempepost!', 'Heisann sveisann!', '2011-01-29 01:15:28.453209')

  def update
    @forum_post = ForumPost.find(params[:id])
    respond_to do |format|
      if can?(:update, @forum_post) and @forum_post.update_attributes(params[:forum_post])
---
SELECT "forum_posts".* FROM "forum_posts" WHERE ("forum_posts"."id" = 1) LIMIT 1
UPDATE "forum_posts" SET "updated_at" = '2011-01-26 04:15:32.576770', "title" = 'Katten', "body" = 'Dette er siste nytt.' WHERE ("forum_posts"."id" = 8)