app/controllers/forum_threads_controller.rb

SELECT "forums".* FROM "forums" WHERE ("forums"."id" = 1) LIMIT 1
---
  def new
    @forum = Forum.find(params[:forum_id]) if can?(:create, ForumThread)

SELECT "forum_threads".* FROM "forum_threads" WHERE ("forum_threads"."id" = 1) LIMIT 1
---
  def edit
    @forum_thread = ForumThread.find(params[:id])

SELECT "forum_threads".* FROM "forum_threads" WHERE ("forum_threads"."id" = 1) LIMIT 1
---
  def show
    @forum_thread = ForumThread.find(params[:id]) if can?(:read, ForumThread)

INSERT INTO "forum_threads" ("title", "created_at", "body", "user_id", "updated_at", "forum_id") VALUES ('Peace prize!', '2011-01-29 03:16:13.671373', 'Whadda you think about it?', 1, '2011-01-29 03:16:13.671373', 1)
---
  def create
    #@forum_thread = ForumThread.new(params[:forum_thread])
    @forum_thread.forum_id = params[:forum_id]
    @forum_thread.user = current_user
    respond_to do |format|
      if can?(:create, ForumThread) and @forum_thread.save

SELECT "forum_threads".* FROM "forum_threads" WHERE ("forum_threads"."id" = 1) LIMIT 1
UPDATE "forum_threads" SET "updated_at" = '2011-01-26 03:33:59.635468', "title" = 'Forumtråddd' WHERE ("forum_threads"."id" = 1)
---
  def update
    @forum_thread = ForumThread.find(params[:id])

    respond_to do |format|
      if can?(:update, @forum_thread) and @forum_thread.update_attributes(params[:forum_thread])