app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ('t'='f') LIMIT 20
---
  def index
    @users = User.accessible_by(current_ability, :index).limit(20)