app/controllers/users_controller.rb

  def new
		@roles_new = Role.all
---
SELECT "roles".* FROM "roles"

  def show
    if can?(:read, User)
      @user = User.find(params[:id])
      @roles = ""

      @user.roles.each do |role|
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 0) LIMIT 1
SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 1 ) LIMIT 1

  def edit
    @user = User.find(params[:id])
    if can?(:update, @user)
      @roles = ""

      @user.roles.each do |role|
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 4 )

  def create
    if can?(:create, User)
      @user = User.new(params[:user])
      password_unencrypted = params[:user][:password]
      role = Role.where(:name => "normal")
      if role == nil or role.empty?
        role = Role.new
        role.name = "normal"
        role.save
      end
      @user.roles.push(role)
---
SELECT "roles".* FROM "roles"
INSERT INTO "roles" ("updated_at", "name", "created_at") VALUES ('2011-01-27 21:08:14.926475', 'normal', '2011-01-27 21:08:14.926475')
INSERT INTO "users" ("password_salt", "created_at", "picture_file_name", "email", "remember_created_at", "description", "reset_password_token", "last_sign_in_at", "current_sign_in_at", "surname", "current_sign_in_ip", "firstname", "remember_token", "picture_file_size", "picture_updated_at", "encrypted_password", "sign_in_count", "last_sign_in_ip", "updated_at", "picture_content_type") VALUES ('$2a$10$r0zJUPkM3mWvd8RDQ6/NNu', '2011-01-29 20:08:43.360151', NULL, 'sindrehansen86@gmail.com', NULL, 'ssdsd', NULL, NULL, NULL, 'Hansen', NULL, 'Sindre', NULL, NULL, NULL, '$2a$10$r0zJUPkM3mWvd8RDQ6/NNuHbJP/Q/Gj5fN6/O77PHozZtDQAZeKX6', 0, NULL, '2011-01-29 20:08:43.360151', NULL)

  def update
    @user = User.find(params[:id])

    # If you can manage users: Always provide your own password to verify changes
    # Else: Provide the user's password
    valid_password = false
    if (can?(:manage, User))
      valid_current_password = current_user.valid_password?(params[:user][:current_password])
    else
      valid_current_password = @user.valid_password?(params[:user][:current_password])
    end

    @user.errors[:base] << "The password you entered is incorrect" unless valid_current_password
    if params[:user][:password].blank?
      [:password,:password_confirmation,:current_password].collect {|p| params[:user].delete(p)}
    end

    respond_to do |format|
      if can?(:update, User) and @user.errors[:base].empty? && @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-01-28 20:00:51.971511', "password_salt" = '$2a$10$dhTumO0e5Ok.TRVsPT28Du', "encrypted_password" = '$2a$10$dhTumO0e5Ok.TRVsPT28DuTwKOd8X5oCdYyIGjSo.3EGI29nNPkhW', "email" = 'kalle@kalle2.com' WHERE ("users"."id" = 4)