app/views/forum_threads/show.html.erb

    </tr>
  <% @forum_thread.forum_posts.each do |f| %>
---
SELECT "forum_posts".* FROM "forum_posts" WHERE ("forum_posts".forum_thread_id = 1)